
import Foundation

//:# დავალება 1.
/*: * callout(შექმენი 500 ელემენტიანი მასივი და შეავსე 100-დან 1000-ის ჩათვლით შემთხვევითი რიცხვებით. ):
 Int.random(in: 100...1000) აბრუნებს შემთვევით რიცხვს 100-დან 1000-ის ჩათვლით.
*/
//:* იპოვე მასივში არსებული უდიდესი ელემენტი

//:* იპოვე მასივში არსებული უნიკალური ელემენტების რაოდენობა.

//:* იპოვე მასივში ყველა 100 ის ჯერადი რიცხვი ( გამოყავი ცალკე მასივად )

//:* დათვალეთ მასივში არსებული რიცხვების საშუალო

//:* დათვალეთ მასივში თითოეული ელემენტი რამდენჯერ მეორდება

//Int.random(in: 100...1000) აბრუნებს შემთვევით რიცხვს 100-დან 1000-ის ჩათვლით.

//:# დავალება 2.
/*: * callout(დაითვალე მასივში არსებული სტრინგებიდან რამდენია პალინდრომი):
 პალინდრომი არის ტექსტი, რომელიც ორივე მხრიდან ერთნაირად იკითხება.
*/
//let array = ["ABA", "AKKA", "0101"]
//მასივში არის ორი პალინდრომი, "ABA" და "AKKA".
//: ### ყველა გალაქტიონი ვერ იქნება :)
//: ### აი, რა მზის სიზმარია,
//: ### აირევი, ივერია...
//: ### აი დროშა, აშორდია,
//: ### აერების სიბერეა.
let strings = ["", "ABA", "AKKA", "0101", "0", "11", "12", "123", "აიია"]



//: [Next](@next)
